artillery/submit_jobs.yaml
config:
  target: "http://localhost:8000/api/v1"
  phases:
    - duration: 10
      arrivalRate: 1
      name: Warm up
  payload:
    path: "job_data.csv"
    fields:
      - "input"

      
scenarios:
  - name: "Load test 1"
    flow:
      - post:
          url: "/jobs"
          json:
            input: "{{ input }}"